# button labels
bl_taste_of_tea = '☕️ طعم چای'
bl_soalino = '💡 سوالینو'
bl_contact_us = '☎️ پل‌های ارتباطی'
bl_fragrant_lines = '📖 خطوط خوش عطر'
bl_what_is_taste_of_tea = '🤔 طعم چای چیه؟'
bl_introduction = '📚 معرفی کنید'
bl_want_to_read = '📥 می‌خوام بخونم'
bl_want_to_send = '📤 می‌خوام بفرستم'
bl_what_is_soalino = '🤔 سوالینو چیه؟'
bl_soalino_98 = '🏅 سوالینوی نود و هشت'
bl_soalino_question = '❓ سوال سوالینو'
bl_soalino_send_answer = '✅ ارسال پاسخ سوالینو'
bl_back = '🔙 بازگشت'
bl_goto_main = '📋 منوی اصلی'

# messages
msg_start = 'خوش اومدی 😊'
msg_main_menu = 'لطفا یکی از گزینه‌ها رو انتخاب کن 🙂'
